import org.junit.jupiter.api.Test;

import static org.junit.jupiter.api.Assertions.*;
class DeckTest {

//    @Test
//    void getPointName() {
//
//        Deck deck = new Deck();
//
//        String[] array = {
//                "очков",
//                "очко",
//                "очка",
//                "очка",
//                "очка",
//                "очков",
//                "очков",
//                "очков",
//                "очков",
//                "очков",
//                "очков",
//                "очков",
//                "очков"
//        };
//
//        for(int id = 0; id <11; id++){
//            String expected = array[id];
//            String actual = deck.getPointName(id);
//            assertEquals(expected, actual);
//        }
//    }
//
//    @Test
//    void getName() {
//            String[] names = {
//            "6 очков, шесть, крести",
//            "7 очков, семь, крести",
//            "8 очков, восемь, крести",
//            "9 очков, девять, крести",
//            "10 очков, десять, крести",
//            "4 очка, король, крести",
//            "3 очка, дама, крести",
//            "2 очка, валет, крести",
//            "1 очко, туз, крести",
//
//            "6 очков, шесть, треф",
//            "7 очков, семь, треф",
//            "8 очков, восемь, треф",
//            "9 очков, девять, треф",
//            "10 очков, десять, треф",
//            "4 очка, король, треф",
//            "3 очка, дама, треф",
//            "2 очка, валет, треф",
//            "1 очко, туз, треф",
//
//            "6 очков, шесть, буби",
//            "7 очков, семь, буби",
//            "8 очков, восемь, буби",
//            "9 очков, девять, буби",
//            "10 очков, десять, буби",
//            "4 очка, король, буби",
//            "3 очка, дама, буби",
//            "2 очка, валет, буби",
//            "1 очко, туз, буби",
//
//            "6 очков, шесть, пики",
//            "7 очков, семь, пики",
//            "8 очков, восемь, пики",
//            "9 очков, девять, пики",
//            "10 очков, десять, пики",
//            "4 очка, король, пики",
//            "3 очка, дама, пики",
//            "2 очка, валет, пики",
//            "1 очко, туз, пики",
//    };
//    }
}